uhnp/src/InformationRegisters/ФункциональныеНаправленияФизическихЛиц/ФункциональныеНаправленияФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФункциональныеНаправленияФизическихЛиц</name>
  <resources>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ФункциональныеНаправленияФизическихЛиц/ManagerModule.bsl
Функция ФункциональноеНаправлениеФизЛица(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФункциональныеНаправленияФизическихЛиц.ФункциональноеНаправление КАК ФункциональноеНаправление
		|ИЗ
		|	РегистрСведений.ФункциональныеНаправленияФизическихЛиц КАК ФункциональныеНаправленияФизическихЛиц
		|ГДЕ
		|	ФункциональныеНаправленияФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ФункциональноеНаправление;
	КонецЕсли;
	
	Возврат Справочники.ФункциональныеНаправления.ПустаяСсылка();
	
КонецФункции
